Revit 2024 API
MEPSystem.Elements Property
Terminal elements in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementSet Elements { get; }
Visual Basic
Public ReadOnly Property Elements As ElementSet
	Get
Visual C++
public:
property ElementSet^ Elements {
	ElementSet^ get ();
}
Remarks
The return value is a read only collection and doesn't include the base equipment or panel.
See Also
MEPSystem Class
Autodesk.Revit.DB Namespace